Examinator/src/InformationRegisters/ФИОПользователейСУО/ФИОПользователейСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ФИОПользователейСУО</name>
  <resources>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/ФИОПользователейСУО/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

Процедура ДобавитьСведения(Знач Пользователь, Знач Наименование = Неопределено) Экспорт
	
	Если Наименование = Неопределено Тогда
		Наименование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Пользователь, "Наименование");
	КонецЕсли;
	
	Пробел = " ";
	
	Запись = РегистрыСведений.ФИОПользователейСУО.СоздатьМенеджерЗаписи();
	Запись.Пользователь = Пользователь;
	
	Наименование = СокрЛП(Наименование);
	МассивНаименования = ОбщегоНазначенияСУКлиентСервер.РасщепитьСтроку(Наименование, Пробел);
	ДлинаМассива = МассивНаименования.Количество();
	Для Индекс = 0 По ДлинаМассива - 1 Цикл
		МассивНаименования[Индекс] = СокрЛП(МассивНаименования[Индекс]);
	КонецЦикла;
	ОбщегоНазначенияКлиентСервер.УдалитьВсеВхожденияЗначенияИзМассива(МассивНаименования, "");
	ДлинаМассива = МассивНаименования.Количество();
	
	Если ДлинаМассива > 0 Тогда
		Запись.Фамилия = МассивНаименования[0];
	КонецЕсли;
	
	Если ДлинаМассива > 1 Тогда
		Запись.Имя = МассивНаименования[1];
	КонецЕсли;
	
	Если ДлинаМассива > 2 Тогда
		Запись.Отчество = МассивНаименования[2];
	КонецЕсли;
	
	Запись.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
